{
  "ir_version": "1.0",
  "project": "omnivault",
  "repository": "https://github.com/plexusone/omnivault",
  "versioning": "semver",
  "commit_convention": "conventional",
  "unreleased": {},
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-03-01",
      "highlights": [
        {
          "description": "Module path migrated from agentplexus to plexusone organization"
        }
      ],
      "changed": [
        {
          "description": "Module path changed from `github.com/agentplexus/omnivault` to `github.com/plexusone/omnivault`"
        },
        {
          "description": "All internal imports updated to use new module path"
        },
        {
          "description": "Documentation URLs updated to plexusone organization"
        },
        {
          "description": "Bump `golang.org/x/crypto` from 0.47.0 to 0.48.0"
        }
      ]
    },
    {
      "version": "v0.2.1",
      "date": "2026-01-18",
      "highlights": [
        {
          "description": "Cross-platform daemon code refactored to use oscompat library"
        }
      ],
      "changed": [
        {
          "description": "Replace platform-specific daemon code with `github.com/grokify/oscompat` library",
          "commit": "61da315"
        },
        {
          "description": "Go version updated to 1.25.5",
          "commit": "61da315"
        },
        {
          "description": "Update CI workflow Go versions",
          "commit": "6b6f0e6"
        },
        {
          "description": "Bump `golang.org/x/crypto` from 0.46.0 to 0.47.0",
          "commit": "f13bde7"
        }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-10",
      "highlights": [
        {
          "description": "Full-featured CLI tool for local secret management"
        },
        {
          "description": "AES-256-GCM encryption with Argon2id key derivation"
        },
        {
          "description": "Daemon architecture with cross-platform support (macOS, Linux, Windows)"
        }
      ],
      "added": [
        {
          "description": "CLI tool (`cmd/omnivault`) for local secret management",
          "commit": "e8c2cd1"
        },
        {
          "description": "Encrypted local store with AES-256-GCM encryption (`internal/store`)",
          "commit": "00b5bbd"
        },
        {
          "description": "Argon2id key derivation with OWASP-recommended parameters",
          "commit": "00b5bbd"
        },
        {
          "description": "Daemon server with Unix socket IPC (`internal/daemon`)",
          "commit": "8942c99"
        },
        {
          "description": "Daemon client library for IPC (`internal/client`)",
          "commit": "050da9c"
        },
        {
          "description": "Platform-specific path configuration (`internal/config`)",
          "commit": "8942c99"
        },
        {
          "description": "Auto-lock with configurable inactivity timeout (default: 15 minutes)",
          "commit": "8942c99"
        },
        {
          "description": "Master password change with automatic re-encryption",
          "commit": "00b5bbd"
        },
        {
          "description": "CLI commands: `init`, `unlock`, `lock`, `status`, `get`, `set`, `list`, `delete`",
          "commit": "e8c2cd1"
        },
        {
          "description": "Daemon commands: `daemon start`, `daemon stop`, `daemon status`, `daemon run`",
          "commit": "e8c2cd1"
        },
        {
          "description": "Secure password input without terminal echo",
          "commit": "e8c2cd1"
        },
        {
          "description": "Integration tests for daemon and encrypted store",
          "commit": "9fa1cbf"
        },
        {
          "description": "Windows daemon support via TCP on localhost (`127.0.0.1:19839`)",
          "commit": "c8a501a"
        },
        {
          "description": "Cross-platform IPC: Unix socket on macOS/Linux, TCP on Windows",
          "commit": "c8a501a"
        }
      ],
      "changed": [
        {
          "description": "Go version updated to 1.24.0"
        }
      ],
      "security": [
        {
          "description": "Secrets encrypted at rest using AES-256-GCM",
          "commit": "00b5bbd"
        },
        {
          "description": "Master password never stored, only used for key derivation",
          "commit": "00b5bbd"
        },
        {
          "description": "Constant-time password verification to prevent timing attacks",
          "commit": "00b5bbd"
        },
        {
          "description": "Keys zeroed from memory on vault lock",
          "commit": "8942c99"
        }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-01-01",
      "highlights": [
        {
          "description": "Unified Go library for secret management across multiple providers"
        },
        {
          "description": "Extensible provider architecture with zero external dependencies"
        },
        {
          "description": "URI-based secret resolution for multi-provider environments"
        }
      ],
      "added": [
        {
          "description": "Core `vault.Vault` interface for secret management",
          "commit": "91795f4"
        },
        {
          "description": "Built-in providers: environment variables, file-based, in-memory",
          "commit": "91795f4"
        },
        {
          "description": "URI-based secret resolution with `Resolver`",
          "commit": "91795f4"
        },
        {
          "description": "Client API with `Get`, `Set`, `Delete`, `List`, `Exists` operations",
          "commit": "91795f4"
        },
        {
          "description": "Extensible provider architecture for external modules",
          "commit": "91795f4"
        },
        {
          "description": "Secret metadata support with tags and timestamps",
          "commit": "91795f4"
        },
        {
          "description": "Multi-field secrets support",
          "commit": "91795f4"
        }
      ]
    }
  ]
}
